"""
2. Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.
Виконав: Перепелиця А.С.
"""
from datetime import datetime

def do(a):
    sum = 0
    if a > 10: #Проверка на однозначное число
        for n in str(a):
            sum += int(n) #Сумирование чисел
        return(do(sum)) #Заход на рекурсию
    else:
        return(a)

a = int(input()) # ввод начальных значений значений
start_time = datetime.now()#Начало записи аремени
print(do(a)) #вывод суммы
print(datetime.now() - start_time) #Вывод времени