"""
2. Сформувати функцію для обчислення цифрового кореню натурального числа.
Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
числа.
Виконав: Перепелиця А.С.
"""
from datetime import datetime

a = int(input()) # ввод начальных значений значений
start_time = datetime.now()#Начало записи аремени
while a > 10:
    sum = 0
    for n in str(a):
        sum += int(n) # Сумирование цыфр в числе
    a = sum #Переназначение значений для следующей итерации
print(a) # вывод результата
print(datetime.now() - start_time) #Вывод времени