"""
1. Сформувати функцію для введення з клавіатури послідовності чисел і виведення
її на екран у зворотному порядку (завершаючий символ послідовності – крапка)
Виконав: Перепелиця А.С.
"""
from datetime import datetime
def do(a,b):
    if b >= 0:
        print(a[b]) # вывод результата
        do(a,b-1)
a = list()
j = input() # ввод начальных значений значений
start_time = datetime.now()#Начало записи аремени
while (j!="."):
    a.append(j) #Заполнение массива
    j = input() # ввод начальных значений значений
do(a,len(a)-1) #вызов функции
print(datetime.now() - start_time) #Вывод времени
