"""
1. Сформувати функцію для введення з клавіатури послідовності чисел і виведення
її на екран у зворотному порядку (завершаючий символ послідовності – крапка)
Виконав: Перепелиця А.С.
"""
from datetime import datetime
a = list()
j = input() # ввод начальных значений значений
start_time = datetime.now() # Начало записи аремени
while (j!="."):
    a.append(j)
    j = input() # ввод начальных значений значений
for n in range(len(a)-1,-1,-1):
    print(a[n]) # вывод результата
print(datetime.now() - start_time) #Вывод времени