"""
2. Сформувати функцію, що визначатиме чи є задане натуральне число простим.
Простим називається число, що більше за 1 та не має інших дільників, окрім 1 та самого
себе).
Виконав: Перепелиця А.С.
"""
from datetime import datetime
a = int(input()) # ввод начальных значений значений
flag = True
start_time = datetime.now()#Начало записи аремени
for n in range(2,a): #итерации
    if a%n == 0:
        flag = False #Детектим выполнение условий
        break
print(flag) # вывод результата
print(datetime.now() - start_time) #Вывод времени