"""
3. Сформувати функцію для переведення натурального числа з десяткової системи
числення у шістнадцятирічну.
Виконав: Перепелиця А.С.
"""
from datetime import datetime
def do(n):
    global rez
    ost = hex_list[n % 16] #Получение остачи от деения на 16
    n = n // 16
    if n:
        rez+= ost # якщо поділилось, то додаємо до результата остачу і виводимо
        do(n) #рекурсия!
    else:
        rez+=ost

hex_list = "0123456789ABCDEF" # змінна, де зберігаються числа і букви в 16-ній системі
rez = ""
n = int(input('Введіть число n: '))
start_time = datetime.now()#Начало записи аремени
do(n) #Вызов функции
k = rez[::-1]  # Для правильного отображения необходимо развернуть
print(k) # вывод результата
print(datetime.now() - start_time) #Вывод времени