"""23. Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300."""
from random import randint
A = list()
sum = 0
kol = 0
for n in range(20):
    A.append(randint(150, 300))
    # Создание масива
for n in range(len(A)):
    sum+=A[n]
# вычисление суммы данных масива
sum = sum/len(A)
# Получение среднего
for n in range(len(A)):
    if A[n]>sum:
        kol+=1
# Подсчёт по фильтру данных
print(kol)