"""27. Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року."""
A = list()
sum = 0
kol = 0
minv = 100000
min = 0
for n in range(12):
    A.append(int(input()))
#Creating array
for n in range(12):
    sum+=A[n]
    if A[n] < 30:
        kol+=1
    if A[n] < minv:
        minv = A[n]
        min = n+1
print(sum, sum/12, kol, min)