"""51. Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення."""
from random import randint
a = list()
for n in range(30):
    a.append(randint(0,100))
b = list()
for n in range(len(a)):
    if a[n] - n == 10:
        b.append(a[n])
if len(b) == 0:
    print("Не знайдено елементів масиву а, які перевищують свій номер на 10")