#2. задача полягає у вивченні і реалізації алгоритмів пошуку для даних, підготовлених
#за допомогою функції моделювання випадкових чисел і текстів, підготовлених
#самостійно.
#для кожного алгоритму необхідно підготувати тести, що підтверджують
#працездатність програми. для всіх алгоритмів пошуку повинні бути приведені лістинги
#програм пошуку та лістинги результатів (номера позиції в вихідному масиві, починаючи
#з якого розташований елемент або фрагмент пошуку; кількості порівнянь по кожному
#алгоритму пошуку).
#найпростіші алгоритми пошуку:
# лінійний пошук;
# бінарний пошук;
# прямий пошук підрядка.
import numpy as np
import random
import time
print("Виберiть номер для перевiрки:")
p = int(input())
if p == 1:
    x = int(input("Введiть розмiрнiсть масиву:"))
    A = np.zeros(x, dtype = int)
    x = int(input('Введiть число яке шукаемо:'))
    t = int(input("Вводимо елемент з клавiатури(1) чи рандомно(0):"))

    for n in range(5):
        A[n] = (random.randint(-5,5))if t == 0 else int(input(f"Введiть число на мiсце масиву № {n+1}"))
    print(A)
    n = len(A)
    i = 0
    start_time = time.time()
    while i<n and A[i]!=x:
        i+=1
    print("Пройшло --- %s seconds ---" % (time.time() - start_time))
    if i==n:
        print("Елемент не присутнiй в масивi")
    else:
        print(f'Елемент {x} на  {i}-у мiсцi в масивi')
    print(f"Було проведено {i*2} перевiрок")
elif p == 2:
    x = int(input("Введiть розмiрнiсть масиву:"))
    A = np.zeros(x, dtype = int)
    x = int(input('Введiть число яке шукаемо:'))
    t = int(input("Вводимо елемент з клавiатури(1) чи рандомно(0):"))

    for n in range(5):
        A[n] = (random.randint(-5,5))if t == 0 else int(input(f"Введiть число на мiсце масиву № {n+1}"))
    print(A)
    L = 0
    R = len(A)-1
    k = 0
    A = A.sort()
    p = 0
    flag = False
    start_time = time.time()
    while L <=R and not flag:
        k = (L+R)//2
        if A[k] == x:
            flag=True
            p+=1
        elif A[k] <x:
            L=k+1
            p+=1
        else:
            R=k-1
            p+=1
    if not flag:
        print("Елемент не знайдено")
    else:
        print("Елемент знайдено на",str(k),"мiсцi")
    print(f"Було проведено {p} перевiрок",end='')
    print(f"За {(time.time() - start_time)} секунд")
elif p == 3:
    a = "Генетическая информация митохондрий наследуется практически всегда по материнской линии. Каждая органелла имеет несколько фрагментов ДНК, идентичных во всех митохондриях, то есть в клетке находится много копий ее ДНК. "
    b = "ДНК"
    for g in range(len(a)):
        if a[g] == b[0]:
            flag=False
            for f in range(1,len(b)):
                if b[f] == a[g+f]:
                    continue
                else:
                    flag = True
                    break
            if flag:
                g += f
            else:
                print(f"Елемент знайдено на мiсцi з {g} по {g+f}")
                break